################# デフォルト設定 #################
use strict;
use utf8;

package set;

our $password = '';

our $logs_dir = './logs/';

our %rooms = ();

our %games = (
  'sw2' => {
    'name' => 'ソードワールド2.x',
    'status' => ['HP','MP','防護'],
    'bcdice' => 'SwordWorld2.5',
  },
  'dx3' => {
    'name' => 'ダブルクロス3rd',
    'status' => ['HP','侵蝕','行動'],
    'bcdice' => 'DoubleCross',
  },
);

our @replace_regex = (
  { '[|｜](.+?)《(.*?)》' => '<ruby>$1<rp>(</rp><rt>$2</rt><rp>)</rp></ruby>' }, #なろうルビ
  { '《《(.+?)》》' => '<em>$1</em>' }, #カクヨム傍点
  { '\{\{(.+?)\}\}' => '<span class="hide">$1</span>' },
  { "'''(.+?)'''" => '<i>$1</i>' },
  { "''(.+?)''" => '<b>$1</b>' },
  { '%%(.+?)%%' => '<s>$1</s>' },
  { '__(.+?)__' => '<u>$1</u>' },
  { '(^|\n)----+(\n|$)' => '<hr>' },
);

our @replace_help = (
  ['｜テキスト《てきすと》','<ruby>テキスト<rt>てきすと</rt></ruby>','ルビ（ふりがな）を振る'],
  ['《《テキスト》》','<em>テキスト</em>','傍点を振る'],
  ["''テキスト''",  '<b>テキスト</b>','太字にする'],
  ["'''テキスト'''",'<i>テキスト</i>','斜体にする'],
  ['%%テキスト%%',  '<s>テキスト</s>','打消線を引く'],
  ['__テキスト__',  '<u>テキスト</u>','下線を引く'],
  ['{{テキスト}}','<span class="hide">テキスト</span>','文字を透明にする。<br>（ドラッグで選択状態にすると見える）'],
  ['----',  '<hr>','四つ以上のハイフンで水平線'],
);

1;